<a href="https://colab.research.google.com/github/saigowtham627/Fundementals/blob/main/Pandas_2_Series_Methods.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Some important series methods
>astype

>between

>clip

>drop_duplications

>isnull

>dropna

>fillna

>isin

>apply

>copy

In [1]:
import numpy as np
import pandas as pd

In [ ]:
subs = pd.read_csv(r'/content/subs.csv')
#When we have more than one column we have to specify index_col="Some_Columun_name", here only one column
#is there in subs, we need not to specify

In [ ]:
type(subs) #Subs is of df type currently

pandas.core.frame.DataFrame

In [ ]:
#changing subs to series type
subs = subs.squeeze('columns')

In [ ]:
type(subs) #Succesfully changed to Series type

pandas.core.series.Series

In [2]:
#We have 2 columns here, so we have to specify index_col while importing
kohli_ipl = pd.read_csv(r'/content/kohli_ipl.csv', index_col='match_no')
kohli_ipl = kohli_ipl.squeeze('columns')
kohli_ipl

match_no
1       1
2      23
3      13
4      12
5       1
       ..
211     0
212    20
213    73
214    25
215     7
Name: runs, Length: 215, dtype: int64

In [ ]:
import sys
sys.getsizeof(kohli_ipl)

3456

In [ ]:
kohli_ipl = kohli_ipl.astype(dtype=np.int16)
sys.getsizeof(kohli_ipl)

2166

In [ ]:
#Between
kohli_ipl.between(51,99) #Returns a bool mask
kohli_ipl[kohli_ipl.between(51,99)].size

43

In [ ]:
#clip
#clips the value in the specified range
np.clip(kohli_ipl,30,60)
#Every value below 30 will become 30 and every value above 60 will become 60

match_no
1      30
2      30
3      30
4      30
5      30
       ..
211    30
212    30
213    60
214    30
215    30
Name: runs, Length: 215, dtype: int16

In [ ]:
kohli_ipl.clip(10,20)
#All the values below 10 will become 10 and all the values above 20 will become 20

match_no
1      10
2      20
3      13
4      12
5      10
       ..
211    10
212    20
213    20
214    20
215    10
Name: runs, Length: 215, dtype: int16

In [ ]:
#drop_duplicates
#drops the duplicate values
#Gives the flexibility to drop which value, first or last. default is first
temp = pd.Series([0,0,9,9,8,7,7,7,7,5,3,7,1,9,0])
temp.drop_duplicates() #keeps only the first occurance
temp.drop_duplicates(keep='last',inplace=True) #takes an arg keep

In [ ]:
#duplicated(), Checks whether there is a duplicated value or not
temp.duplicated() #All are false, because we have deleted all the duplicates permanently above

4     False
9     False
10    False
11    False
12    False
13    False
14    False
dtype: bool

In [ ]:
kohli_ipl.duplicated() #Tells whether a number has a duplicate or not
#True takes the value 1 and False takes the values 0
kohli_ipl.duplicated().sum() #From above statement, we can there are 137 unique values

137

#Size considers both missing and Non missing values
#Count considers only non missing values

In [ ]:
miss = pd.Series([1,2,2,3,3,3,4,4,4,np.nan,9,1,3,np.nan])
miss.size #14
miss.count() #Excludes 2 missing values and gives 12...(14-2)

12

In [ ]:
miss[miss.isnull()] #9 and 13 rows have null values
miss.isnull().sum() #2 missing values, the function returns true if value at an index is null or Nan. Thus counting all trues gives us 2

2

In [ ]:
#Dropping null values
miss.dropna()

#dropna is an atribute of Series but not attribute of numpy or pandas

0     1.0
1     2.0
2     2.0
3     3.0
4     3.0
5     3.0
6     4.0
7     4.0
8     4.0
10    9.0
11    1.0
12    3.0
dtype: float64

In [ ]:
miss

0     1.0
1     2.0
2     2.0
3     3.0
4     3.0
5     3.0
6     4.0
7     4.0
8     4.0
9     NaN
10    9.0
11    1.0
12    3.0
13    NaN
dtype: float64

In [ ]:
#fillna
miss.fillna(0) #Replacing null values with 0
miss.fillna(miss.mean()) #Replacing missing values with mean of Series
miss.fillna(miss.median()) #Replacing missing values with median of Series
miss.fillna(miss.var()) #Replacing missing values with variance
miss.fillna(miss.std())

0     1.000000
1     2.000000
2     2.000000
3     3.000000
4     3.000000
5     3.000000
6     4.000000
7     4.000000
8     4.000000
9     2.094365
10    9.000000
11    1.000000
12    3.000000
13    2.094365
dtype: float64

In [ ]:
np.isin(1,temp) #Pass the element and the list to check whether the element is in list or not

array(True)

In [ ]:
#Find if vk has out on 49 or 99 anytime
np.isin(kohli_ipl,[49,99]).sum()#Yes, 2 times he has been out on 49 and 99
#Say find which matches, he was out on 49 or 99
kohli_ipl[np.isin(kohli_ipl,[49,99])] #On 82nd and 86th match he was 99 and 49 respectively

match_no
82    99
86    49
Name: runs, dtype: int16

In [ ]:
"""apply""" #Super Useful
#Apply is useful to apply any custom logic

'ohkp'

**Lambda function is an anonymous function in Python, It accepts any number of arguments but has only one expression.The expression is evaluated and returned**

**Lambda functions are often used for short opertions where defining a full function would be a unnecessarily verbose**

**Lambda functions are short and THROWAWAY functions because they are not defined by def key word**

#lambda arguments : expression

In [ ]:
#Exmples of Lambda function
add_two = lambda x : x+2
add_two(10)

#x is the argument
#x + 2 is the expression that is evaluated and returned

12

In [ ]:
numbers = [np.random.randint(1,100,5)] #When we are passing a multiple numbers in a list to lambda function we need to iterate over the list
squared = map(lambda numbers : numbers ** 2, numbers)

"""Map function in Python is used to apply a given function to all the items in iterable such as List or a tuple"""
"""Syntax of Map function : Map(function, Iterable)"""

#When we want to call lambda function on each and every element of the list, we need to call map function and iterate over list of numbers
#lambda function returs address value like (<function <lambda> at 0x7a42986fe3b0>, [1, 2, 3]), It is a map object
#To convert a map object into numbers , We need to pass map object to list

print(list(squared))

[array([ 729, 2401,    9, 1681,  961])]

In [ ]:
#Sort the list of tuples by the second element
pairs = [(1,'One'),(2,'Two'),(3,'Three'),(4,'Four')]
sort = sorted(pairs, key = lambda pair:pair[1]) #Sorted function takes an Iterable object and a key
print(sort)

#Here sorted function can internally itearate over the items so we dont need to iterate

[(4, 'Four'), (1, 'One'), (3, 'Three'), (2, 'Two')]

In [ ]:
#Lambda function for max value
max_value = lambda x,y : x if x>y else y
max_value(90,900)

#Single expression: Lambda functions can only have one expression. You can’t include multiple statements or lines of code.

900

In [ ]:
bollywood = pd.read_csv(r'bollywood.csv', index_col='movie')
bollywood = bollywood.squeeze('columns')
bollywood

movie
Uri: The Surgical Strike                   Vicky Kaushal
Battalion 609                                Vicky Ahuja
The Accidental Prime Minister (film)         Anupam Kher
Why Cheat India                            Emraan Hashmi
Evening Shadows                         Mona Ambegaonkar
                                              ...
Hum Tumhare Hain Sanam                    Shah Rukh Khan
Aankhen (2002 film)                     Amitabh Bachchan
Saathiya (film)                             Vivek Oberoi
Company (film)                                Ajay Devgn
Awara Paagal Deewana                        Akshay Kumar
Name: lead, Length: 1500, dtype: object

In [ ]:
bollywood.apply(lambda lead:lead.split()[0].upper())
#Apply is used to apply custom logic on values

movie
Uri: The Surgical Strike                  VICKY
Battalion 609                             VICKY
The Accidental Prime Minister (film)     ANUPAM
Why Cheat India                          EMRAAN
Evening Shadows                            MONA
                                         ...
Hum Tumhare Hain Sanam                     SHAH
Aankhen (2002 film)                     AMITABH
Saathiya (film)                           VIVEK
Company (film)                             AJAY
Awara Paagal Deewana                     AKSHAY
Name: lead, Length: 1500, dtype: object

In [ ]:
avg = np.mean(subs)

subs.apply(lambda x:'good day' if x > avg else 'bad day')

0       bad day
1       bad day
2       bad day
3       bad day
4       bad day
         ...
360    good day
361    good day
362    good day
363    good day
364    good day
Name: Subscribers gained, Length: 365, dtype: object

In [ ]:
#Copy function

In [3]:
kohli_ipl

match_no
1       1
2      23
3      13
4      12
5       1
       ..
211     0
212    20
213    73
214    25
215     7
Name: runs, Length: 215, dtype: int64

In [5]:
new = kohli_ipl.head()

In [6]:
#Changing the 1st match score of VK to 100
new[1] = 100

In [7]:
kohli_ipl.head()

match_no
1    100
2     23
3     13
4     12
5      1
Name: runs, dtype: int64

#When we are seeing the head of the dataset, we are viewing the original data set but not the copy of its

#So when we are making the changes on the head, we are actually changing the original dataset

#So to avoid this we have to use copy function, to first copy the dataset and do changes on it

In [8]:
new = kohli_ipl.head().copy()

In [9]:
#Changing the 1st match score to 200
new[1] = 200

In [10]:
kohli_ipl #But the value in the original dataset, remained 100 only

match_no
1      100
2       23
3       13
4       12
5        1
      ...
211      0
212     20
213     73
214     25
215      7
Name: runs, Length: 215, dtype: int64